In [251]:
import pandas as pd
import csv

In [252]:
with open("./data/Yelp_Reviews.csv") as file:
    df_yelp = pd.read_csv(file)

df_yelp.head()

,Unnamed: 0,business_id,cool,date,funny,review_id,stars,text,useful,user_id
0,1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5.0,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g
1,2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1.0,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g
2,4,Ums3gaP2qM3W1XcA5r6SsQ,0,2014-09-05,0,jsDu6QEJHbwP2Blom1PLCA,5.0,Delicious healthy food. The steak is amazing. ...,0,msQe1u7Z_XuqjGoqhB0J5g
3,5,vgfcTvK81oD4r50NMjU2Ag,0,2011-02-25,0,pfavA0hr3nyqO61oupj-lA,NaN,This place sucks. The customer service is horr...,2,msQe1u7Z_XuqjGoqhB0J5g
4,10,yFumR3CWzpfvTH2FCthvVw,0,2016-06-15,0,STiFMww2z31siPY7BWNC2g,5.0,I have been an Emerald Club member for a numbe...,0,TlvV-xJhmh7LCwJYXkV-cg

In [253]:
df_yelp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2610 entries, 0 to 2609
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   2610 non-null   int64
 1   business_id  2610 non-null   object
 2   cool         2608 non-null   object
 3   date         2610 non-null   object
 4   funny        2610 non-null   int64
 5   review_id    2610 non-null   object
 6   stars        2607 non-null   float64
 7   text         2610 non-null   object
 8   useful       2610 non-null   int64
 9   user_id      2610 non-null   object
dtypes: float64(1), int64(3), object(6)
memory usage: 204.0+ KB

In [254]:
df_yelp.shape

(2610, 10)

In [255]:
df_yelp['Review_Word_Length'] = df_yelp['text'].map(lambda x: len(x.split()))
df_yelp.head()

,Unnamed: 0,business_id,cool,date,funny,review_id,stars,text,useful,user_id,Review_Word_Length
0,1,pomGBqfbxcqPv14c3XH-ZQ,0,2012-11-13,0,dDl8zu1vWPdKGihJrwQbpw,5.0,I love this place! My fiance And I go here atl...,0,msQe1u7Z_XuqjGoqhB0J5g,58
1,2,jtQARsP6P-LbkyjbO1qNGg,1,2014-10-23,1,LZp4UX5zK3e-c5ZGSeo3kA,1.0,Terrible. Dry corn bread. Rib tips were all fa...,3,msQe1u7Z_XuqjGoqhB0J5g,30
2,4,Ums3gaP2qM3W1XcA5r6SsQ,0,2014-09-05,0,jsDu6QEJHbwP2Blom1PLCA,5.0,Delicious healthy food. The steak is amazing. ...,0,msQe1u7Z_XuqjGoqhB0J5g,30
3,5,vgfcTvK81oD4r50NMjU2Ag,0,2011-02-25,0,pfavA0hr3nyqO61oupj-lA,NaN,This place sucks. The customer service is horr...,2,msQe1u7Z_XuqjGoqhB0J5g,82
4,10,yFumR3CWzpfvTH2FCthvVw,0,2016-06-15,0,STiFMww2z31siPY7BWNC2g,5.0,I have been an Emerald Club member for a numbe...,0,TlvV-xJhmh7LCwJYXkV-cg,32

In [256]:
#
df_yelp["text"].apply(lambda text: len(text.split()))

0        58
1        30
2        30
3        82
4        32
       ...
2605     61
2606     43
2607     79
2608    185
2609     42
Name: text, Length: 2610, dtype: int64

In [257]:
df_yelp.shape

(2610, 11)

In [258]:
df_yelp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2610 entries, 0 to 2609
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          2610 non-null   int64
 1   business_id         2610 non-null   object
 2   cool                2608 non-null   object
 3   date                2610 non-null   object
 4   funny               2610 non-null   int64
 5   review_id           2610 non-null   object
 6   stars               2607 non-null   float64
 7   text                2610 non-null   object
 8   useful              2610 non-null   int64
 9   user_id             2610 non-null   object
 10  Review_Word_Length  2610 non-null   int64
dtypes: float64(1), int64(4), object(6)
memory usage: 224.4+ KB

In [259]:
print(df_yelp)

      Unnamed: 0             business_id cool        date  funny  \
0              1  pomGBqfbxcqPv14c3XH-ZQ    0  2012-11-13      0
1              2  jtQARsP6P-LbkyjbO1qNGg    1  2014-10-23      1
2              4  Ums3gaP2qM3W1XcA5r6SsQ    0  2014-09-05      0
3              5  vgfcTvK81oD4r50NMjU2Ag    0  2011-02-25      0
4             10  yFumR3CWzpfvTH2FCthvVw    0  2016-06-15      0
...          ...                     ...  ...         ...    ...
2605         689  BTcY04QFiS1uh-RpkR7rAg    1  2013-06-02      0
2606        4874  t0T_4MM4EUHbCzBTF11FHA    0  2016-08-14      0
2607         564  5XYR6doRa5Nj1JMfSDei6A    1  2016-06-14      0
2608        3458  aLcFhMe6DDJ430zelCpd2A    0  2013-10-02      0
2609        4206  WdBWhGe4Siqg3IYTc4_K4A    0  2016-08-15      0

                   review_id  stars  \
0     dDl8zu1vWPdKGihJrwQbpw    5.0
1     LZp4UX5zK3e-c5ZGSeo3kA    1.0
2     jsDu6QEJHbwP2Blom1PLCA    5.0
3     pfavA0hr3nyqO61oupj-lA    NaN
4     STiFMww2z31siPY7BWNC2g    5.0
...                      ...    ...
2605  6_A58CCY8SHB7r-Wu7-A5g    5.0
2606  KqQwNyfoFiJOw911mrULIg    5.0
2607  xlGJkxoIBl8XH8wVsPZpnw    5.0
2608  kwiEG_KCpDB6aK5fTSM7iw    2.0
2609  O0ttxNGxHKtD8Cnnwc_j1g    1.0

                                                   text  useful  \
0     I love this place! My fiance And I go here atl...       0
1     Terrible. Dry corn bread. Rib tips were all fa...       3
2     Delicious healthy food. The steak is amazing. ...       0
3     This place sucks. The customer service is horr...       2
4     I have been an Emerald Club member for a numbe...       0
...                                                 ...     ...
2605  Came here with my 2 year old daughter for our ...       2
2606  Great little restaurant. Not to many tables an...       0
2607  Always great friendly service and fresh baked ...       0
2608  We were expecting amazing Thai food after all ...       1
2609  Sunday at 8p. Not many people here at all. We ...       0

                     user_id  Review_Word_Length
0     msQe1u7Z_XuqjGoqhB0J5g                  58
1     msQe1u7Z_XuqjGoqhB0J5g                  30
2     msQe1u7Z_XuqjGoqhB0J5g                  30
3     msQe1u7Z_XuqjGoqhB0J5g                  82
4     TlvV-xJhmh7LCwJYXkV-cg                  32
...                      ...                 ...
2605  q3AiAe-AcpDrNsdZf8nCvQ                  61
2606  NJxaA7q9BhqaDrFpfR2Jeg                  43
2607  kBNFdviedCPFWyR-wVaAzw                  79
2608  PkRFSQgSfca9Tamq7b2LdQ                 185
2609  ic9zIsm7zoxUm3Axyegx8g                  42

[2610 rows x 11 columns]

In [260]:
def sentiment(rating):
    if rating > 3:
        return "positive"
    else:
            return "negative"

In [261]:
df_yelp["sentiment"] = df_yelp["stars"].apply(lambda rating: "")

In [262]:
#check for duplicates
df_duplicated = df_yelp.duplicated().sum()
df_duplicated

333

In [263]:
#view duplicates
df_yelp.duplicated().value_counts()

False    2277
True      333
dtype: int64

In [ ]:
#removing duplicated values
#df_yelp = df_yelp.drop_duplicates()

In [265]:
#verify they have been removed 
df_yelp.duplicated().value_counts()

False    2277
dtype: int64

In [266]:
#data loading for titanic data set
df_titanic = pd.read_csv("./data/titanic.csv")
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

In [267]:
#info
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1391 entries, 0 to 1390
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1391 non-null   float64
 1   Survived     1391 non-null   float64
 2   Pclass       1391 non-null   object
 3   Name         1391 non-null   object
 4   Sex          1391 non-null   object
 5   Age          1209 non-null   float64
 6   SibSp        1391 non-null   float64
 7   Parch        1391 non-null   float64
 8   Ticket       1391 non-null   object
 9   Fare         1391 non-null   float64
 10  Cabin        602 non-null    object
 11  Embarked     1289 non-null   object
dtypes: float64(6), object(6)
memory usage: 130.5+ KB

In [268]:
# detecting null values
#isnull
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          789
Embarked       102
dtype: int64

In [269]:
# strategies for dealing w missing data removing  _mean _mode _median -

In [270]:
#dropping and reassign
df_titanic = df_titanic.drop("Cabin",axis=1)

In [271]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

In [272]:
#dropping inplace
# dropna(axis=0) - drop rows with null values
# dropna(axis=1) - drop columns with null values
#inplace=True - make changes to original dataframe
# not advisable though

In [273]:
#df_titanic.dropna(axis=0,inplace=True)
#df_titanic.info()

In [274]:
# recheck for null values
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

In [275]:
#df_titanic.dropna(axis=1,inplace=True)

#df_titanic.info()

In [276]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

In [277]:
age_median = df_titanic["Age"].median()
age_median

27.0

In [278]:
#replacing missing values with median
df_titanic["Age"] = df_titanic["Age"].fillna(age_median)

In [280]:
#replacing missing values with mode 
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked       102
dtype: int64

In [281]:
df_titanic["Embarked"].value_counts()

S    830
C    285
Q    174
Name: Embarked, dtype: int64

In [282]:
embarked_mode = df_titanic["Embarked"].mode(0)
embarked_mode

0    S
dtype: object

In [283]:
df_titanic["Embarked"]= df_titanic["Embarked"].fillna(embarked_mode[0])

In [284]:
df_titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64